Tekla.Structures.ModelInternal.dotBoltHoleAttributes_t
Struct for the bolt hole attributes.

Tekla.Structures.ModelInternal.dotBoltHoleAttributes_t.HoleType
The hole type.

Tekla.Structures.ModelInternal.dotBoltHoleAttributes_t.LongHoleX
Long hole X value.

Tekla.Structures.ModelInternal.dotBoltHoleAttributes_t.LongHoleY
Long hole Y value.

Tekla.Structures.ModelInternal.dotBoltHoleAttributes_t.SlotOffsetX
Slot offset x.

Tekla.Structures.ModelInternal.dotBoltHoleAttributes_t.SlotOffsetY
Slot offset y.